AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
#define U8LOG_WIDTH 32
#define U8LOG_HEIGHT 4
uint8_t u8log_buffer[U8LOG_WIDTH * U8LOG_HEIGHT];
U8G2LOG u8g2log;

/***********************************
   GP2Y10 sensor based on PMsensor library
   https://github.com/ekkai/PMsensor
*/
#include <PMsensor.h>
PMsensor PM;

/********************************
   my code
*/
double lat = 0;
double lon = 0;

#define INTERVAL        60000
#define TIMETORESET     100
#define SAMPLE_LIMIT    1000
long countSamples = 0;

double slPressure;
const char* town;
#define CCS_WAKE        12     // SDD2 (9), prima era 12 (D6 su nodeMcu)
#define CCS_RESET       14    // SDD3 (10), prima era 14 (D5 on nodeMcu)
#define GPY_LED         16     // D3 (0), prima era 16 (D0 on nodeMcu)
#define GPY_SENSOR      A0    // A0 on nodeMcu

// Thingspeak
//const char* tsHost = "184.106.153.149";
const char* tsHost = "api.thingspeak.com";
const char* tsHostName = "api.thingspeak.com";
String privateKey = "YGXES1DISTOMQ00N";

boolean credentials;

// *** Additional functions
void sendToCloud(bool error, float temp, long pressure, float pmData, float humidity,
                 long CO2, long TVOC);
void getLocation();
void printSerialNumber();
double getSeaLevelPressure(double lat, double lon);
void setupWifi();
void calibrateCCS811();
void writeOledSetupMsg(char *s1, char * s2);
void writeOledData(bool error, float temp, long pressure, float pmData, float humidity,
                   long CO2, long TVOC);
void ccsReset(bool error);
int tryConnecting(String ssid, String pass, int auth);
int save2Eeprom (String str, int first);


/********************************
   let's start doing things
*/
void setup() {
  u8g2.begin();
  u8g2log.begin(U8LOG_WIDTH, U8LOG_HEIGHT, u8log_buffer);

  writeOledSetupMsg("Initialising Serial", "");
  Serial.begin(115200);

  writeOledSetupMsg("Initialising Ports", "");
  pinMode(CCS_WAKE, OUTPUT);
  pinMode(CCS_RESET, OUTPUT);
  pinMode(GPY_LED, OUTPUT);
  digitalWrite(CCS_WAKE, LOW); // Activate CCS811 sensor
  delay(5);
  ccsReset(false);

  Serial.println(" ");
  Serial.println("CCS811 + HDC1080 + BMP280 + Location + OLED test");

  setupWifi();

  getLocation();

  // Init HDC1080
  writeOledSetupMsg("Initialising HDC1080", "");
  hdc1080.begin(0x40);
  writeOledSetupMsg("Initialising HDC1080:", "OK");
  delay(200);

  // Init CCS811
  writeOledSetupMsg("Initialising CCS811", "");
  while ( (!ccs.begin())) {
    writeOledSetupMsg("Init CCS811 failed!", "Check wiring");
    while (1);
  }
  writeOledSetupMsg("Initialising CCS811:", "OK");
  delay(200);
  writeOledSetupMsg("Calibrating CCS811", "");
  calibrateCCS811();
  writeOledSetupMsg("Calibrating CCS811:", "OK");
  delay(200);

  // Init BMP280
  writeOledSetupMsg("Initialising BMP280", "");
  if (!bme.begin()) {
    writeOledSetupMsg("Init BMP280 Failed!", "Check wiring");
    while (1);
  }
  slPressure = getSeaLevelPressure(lat, lon);
  writeOledSetupMsg("Initialising BMP280:", "OK");
  delay(200);

  writeOledSetupMsg("Init GP2Y10 PM sensor", "");
  PM.init(GPY_LED, GPY_SENSOR);
  writeOledSetupMsg("Init GP2Y10 PM sensor:", "OK");
  delay(200);

  writeOledSetupMsg("Init complete", "");
  delay(200);
  u8g2.clear();
}

void loop() {
  // Should we check whether location has changed?
  if ( countSamples >= SAMPLE_LIMIT ) {
    getLocation();
    slPressure = getSeaLevelPressure(lat, lon);
    countSamples = 0;
  }

  // get data from sensors
  float hdcTemp = hdc1080.readTemperature();
  float hdcRH = hdc1080.readHumidity();

  float bmpTemp = bme.readTemperature();
  long bmpPres = (bme.readPressure() / 100);
  float bmpAlt = bme.readAltitude(slPressure); // adjusted to local forcase

  float ccsTemp = -1;
  long ccsCO2 = -1;
  long ccsTVOC = -1;

  float gp2yData = 0;
  int gp2y_err = PMsensorErrSuccess;
  if ((gp2y_err = PM.read(&gp2yData, true, 0.1)) != PMsensorErrSuccess) {
    Serial.print("gp2yData Error = ");
    Serial.println(gp2y_err);
    delay(3000);
    return;
  }

  // get and print
  Serial.print("BMP280  T = ");
  Serial.print(bmpTemp);
  Serial.print(" *C; ");
  Serial.print("P = ");
  Serial.print(bmpPres);
  Serial.print(" hPa; ");
  Serial.print("h = ");
  Serial.print(bmpAlt);
  Serial.println(" m");

  Serial.print("HDC1080 T = ");
  Serial.print(hdcTemp);
  Serial.print(" *C; RH = ");
  Serial.print(hdcRH);
  Serial.println(" %");

  Serial.print("GP2Y10 PM2.5 = ");
  Serial.print(gp2yData);
  Serial.println(" ppm");

  if (ccs.available()) {
    unsigned char ccsError = ccs.readData();
    if (!ccsError) {
      float ccsTemp = ccs.calculateTemperature();
      long ccsCO2 = ccs.geteCO2();
      long ccsTVOC = ccs.getTVOC();
      Serial.print("CCS811  T = ");
      Serial.print(ccsTemp);
      Serial.print(" *C; CO2: ");
      Serial.print(ccsCO2);
      Serial.print(" ppm; TVOC: ");
      Serial.println(ccsTVOC);
      Serial.println();
      writeOledData(ccsError, hdcTemp, bmpPres, gp2yData, hdcRH, ccsCO2, ccsTVOC);
      sendToCloud(ccsError, hdcTemp, bmpPres, gp2yData, hdcRH, ccsCO2, ccsTVOC);

    }
    else {
      Serial.print("CCS811 ERROR no. ");
      Serial.println(ccsError);
      Serial.println("Resetting...");
      Serial.println();
      ccsReset(true);
      writeOledData(ccsError, hdcTemp, bmpPres, gp2yData, hdcRH, ccsCO2, ccsTVOC);
      sendToCloud(ccsError, hdcTemp, bmpPres, gp2yData, hdcRH, ccsCO2, ccsTVOC);
    }
  }
  Serial.println("");
  countSamples++;
  delay(INTERVAL);
}

void printSerialNumber() {
  Serial.print("Device Serial Number=");
  HDC1080_SerialNumber sernum = hdc1080.readSerialNumber();
  char format[12];
  sprintf(format, "%02X-%04X-%04X", sernum.serialFirst, sernum.serialMid, sernum.serialLast);
  Serial.println(format);
}

double getSeaLevelPressure(double lat, double lon) {
  double slPressure;
  // connect to owmServer
  Serial.print("Connecting to ");
  Serial.println(owmServer);
  bool ok = client.connect(owmServer, 80);
  bool beginFound = false;

  while (!ok) {
    Serial.print(".");
    delay(500);
  }
  Serial.print("Connected to ");
  Serial.println(owmServer);

