AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
  delay(500);

  Serial.println("Sending request...");
  //Send request to resource
  client.print("GET ");
  client.print(resource1);
  client.print(lat);
  client.print(resource2);
  client.print(lon);
  client.print(resource3);

  client.println(" HTTP/1.1");
  client.print("Host: ");
  client.println(owmServer);
  client.println("Connection: close");
  client.println();

  delay(100);

  //Reading stream and remove headers
  client.setTimeout(10000);

  bool ok_header = client.find("\r\n\r\n");

  while (!ok_header) {
    // wait
  }

  client.readBytes(response, 800);

  // uncomment line below to see data received for debugging purposes or just fun
  Serial.println(response);

  // process JSON
  DynamicJsonDocument jsonBuffer;
  DeserializationError error = deserializeJson(jsonBuffer, response);
  if (error) {
    Serial.println("There was an error while deserializing");
  } else {
    // But.....make sure the stream header is valid
    // Sometime OWM includes invalid data after the header
    // Parsing fails if this data is not removed

    Serial.println("Response received");

    JsonObject root = jsonBuffer.as<JsonObject>();

    town = root["name"];
    const char* shortWeather = root["weather"][0]["main"];
    const char* weather = root["weather"][0]["description"];
    double temp = root["main"]["temp"];
    int pressure = root["main"]["pressure"];
    slPressure = pressure;
    int humidity = root["main"]["humidity"];

    // Print data to Serial
    Serial.print("*** ");
    Serial.print(town);
    Serial.println(" ***");
    Serial.print("Type: ");
    Serial.println(shortWeather);
    Serial.print(" (");
    Serial.print(weather);
    Serial.println(")");
    Serial.print("Temp ");
    Serial.print(temp);
    Serial.println("C");
    Serial.print("pressure ");
    Serial.print(pressure);
    Serial.println(" bar");
    Serial.print("humidity ");
    Serial.print(humidity);
    Serial.println("%");
    Serial.println("----------");

    client.stop(); // disconnect from owmServer

    Serial.println("");
  }
  return slPressure;
}

void setupWifi() {
  writeOledSetupMsg("Connecting to WiFi:", const_cast<char*>(ssid));
  // Connect to WPA/WPA2 network
#ifdef ARDUINO_ARCH_ESP32
  WiFi.mode(WIFI_MODE_STA);
#endif
#ifdef ARDUINO_ARCH_ESP8266
  WiFi.mode(WIFI_STA);
#endif
  WiFi.begin(ssid, passwd);
  while (WiFi.status() != WL_CONNECTED) {
    Serial.print("Attempting to connect to WPA SSID: ");
    Serial.println(ssid);
    // wait 5 seconds for connection:
    Serial.print("Status = ");
    Serial.println(WiFi.status());
    delay(500);
  }
}

void calibrateCCS811() {
  //calibrate CCS811
  while (!ccs.available());
  double temp = hdc1080.readTemperature();
  uint8_t rh = (uint8_t)hdc1080.readHumidity();
  float tccs = ccs.calculateTemperature();

  Serial.print("HDC1080 T = ");
  Serial.print(temp);
  Serial.print(" *C; RH = ");
  Serial.print(rh);
  Serial.println(" %");
  Serial.print("CCS811  T = ");
  Serial.print(tccs);
  Serial.println(" *C");
  ccs.setEnvironmentalData(rh, temp);
  ccs.setTempOffset(temp - 25.0);
  Serial.println("CCS811 Calibrated");
}

void writeOledSetupMsg(char *s1, char * s2) {
  Serial.print (s1);
  Serial.print (" ");
  Serial.println(s2);
  Serial.println("");

  u8g2log.print(s1);
  u8g2log.print(" ");
  u8g2log.print(s2);
  u8g2log.print("\n");

  u8g2.firstPage();
  do {
    u8g2.setFont(u8g2_font_crox5h_tf);
    u8g2.drawStr(10, 17, "Air Quality");
    u8g2.drawStr(22, 35, "Monitor");
    u8g2.setFont(u8g2_font_4x6_tr);   // set the font for the terminal window
    u8g2.drawLog(0, 42, u8g2log);   // draw the terminal window on the display
  } while ( u8g2.nextPage() );
}

void writeOledData(bool error, float temp, long pressure, float pmData, float humidity,
                   long CO2, long TVOC) {
  if (error) {
    u8g2.firstPage();
    do {
      writeOledSetupMsg("ERROR!", "Resetting");
    } while ( u8g2.nextPage() );
  } else {
    u8g2.firstPage();
    do {
      u8g2.setFont(u8g2_font_crox2h_tf);
      u8g2.drawStr(0, 12, "Air Quality Monitor");
      u8g2.setFont(u8g2_font_crox1h_tf);
      u8g2.setCursor(0, 24);
      u8g2.print(town);
      u8g2.print(" (");
      u8g2.print(lat);
      u8g2.print(";");
      u8g2.print(lon);
      u8g2.print(")");
      u8g2.setCursor(0, 39);
      u8g2.print("T: ");
      u8g2.print(temp, 1);
      u8g2.print((char)176);
      u8g2.print("C");
      u8g2.setCursor(0, 51);
      u8g2.print("P: ");
      u8g2.print(pressure);
      u8g2.print("hPa");
      u8g2.setCursor(0, 63);
      u8g2.print("PM2.5: ");
      u8g2.print(pmData, 1);
      //      u8g2.print("m");
      u8g2.setCursor (62, 39);
      u8g2.print("RH: ");
      u8g2.print(humidity, 1);
      u8g2.print("%");
      u8g2.setCursor (62, 51);
      u8g2.print("CO2:");
      u8g2.print(CO2);
      u8g2.print("ppm");
      u8g2.setCursor (62, 63);
      u8g2.print("TVOC: ");
      u8g2.print(TVOC);
      u8g2.print("ppb");

    } while ( u8g2.nextPage() );
  }
}

void ccsReset(bool error) {

  if (error) {
    writeOledSetupMsg("ERROR!", "Resetting");
  } else {
    writeOledSetupMsg("Resetting", "");
  }
  digitalWrite(CCS_RESET, LOW); // hardware reset CCS811 sensor
  delay(10);
  digitalWrite(CCS_RESET, HIGH); // normal  CCS811 sensor
  delay(100);
  ccs.SWReset();
  delay(TIMETORESET);

}

void getLocation() {
  writeOledSetupMsg("Getting location", "");

  location_t loc = location.getGeoFromWiFi();

  Serial.println("Location request data");
  Serial.println(location.getSurroundingWiFiJson());
  lat = loc.lat;
  lon = loc.lon;
  Serial.println("Latitude: " + String(loc.lat, 7));
  Serial.println("Longitude: " + String(loc.lon, 7));
  Serial.println("Accuracy: " + String(loc.accuracy));
}

void sendToCloud(bool error, float temp, long pressure, float pmData, float humidity,
                 long CO2, long TVOC) {
  Serial.println("Sending this data");
  Serial.print("T: ");
  Serial.print(temp);
  Serial.print("; P: ");
  Serial.print(pressure);
  Serial.print("; RH: ");
  Serial.print(humidity);
  Serial.print("; PM2.5: ");
  Serial.print(pmData);
  Serial.print("; CO2: ");
  Serial.print(CO2);
  Serial.print("; TVOC: ");
  Serial.println(TVOC);
  Serial.println();

  if (!error) {
    Serial.print("Sending data to cloud ");
    // Use WiFiClient class to create TCP connections
    WiFiClient client;
    const int httpPort = 80;
    if (!client.connect(tsHost, httpPort)) {
      Serial.println("connection failed");
      return;
    }

