AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
    // We now create a body for the request
    String body = "";
    //    body += "/update";
    //    body += "?api_key=";
    body += privateKey;
    body += "&field1=";
    body += String(temp);
    body += "&field2=";
    body += String(humidity);
    body += "&field3=";
    body += String(pressure);
    body += "&field4=";
    body += String(CO2);
    body += "&field5=";
    body += String(TVOC);
    body += "&field6=";
    body += String(pmData);
    body += "\r\n\r\n";

    Serial.println("Sending POST data: ");
    Serial.println(body);

    client.println("POST /update HTTP/1.1");
    client.println("Host: api.thingspeak.com");
    client.println("User-Agent: ESP8266 (nothans)/1.0");
    client.println("Connection: close");
    client.println("X-THINGSPEAKAPIKEY: " + privateKey);
    client.println("Content-Type: application/x-www-form-urlencoded");
    client.println("Content-Length: " + String(body.length()));
    client.println("");
    client.print(body);
    delay(10);

    // Read all the lines of the reply from thingspeak server and print them to Serial
    while (client.available()) {
      String line = client.readStringUntil('\r');
      Serial.print(line);
    }

    Serial.println();
    Serial.println("closing connection");
    client.stop();
  }
}


/*********************************************************************+
   Function:    STA_setupWiFi
   Description:
   Parameters:  void
   Returns:     void
 *********************************************************************/
void STA_setupWiFi() {
  WiFi.mode(WIFI_STA);
  Serial.println();
  Serial.print("My IP address as a Station is: ");
  Serial.println(WiFi.localIP());
  Serial.println();

  webServer.on("/", STA_handleRoot);
  webServer.on("/reset", STA_handleReset);
  webServer.on("/restart", STA_handleRoot);
  webServer.on("/setup", STA_handleRoot);

  webServer.onNotFound(STA_handleNotFound);

  webServer.begin();
  Serial.print("HTTP webServer started (STA mode) at ");
  Serial.println(WiFi.localIP());
}

/*********************************************************************+
   Function:    AP_setup
   Description:
   Parameters:  void
   Returns:     String
 *********************************************************************/
String AP_setup()
{
  // Do a little work to get a unique-ish name. Append the
  // last two bytes of the MAC (HEX'd) to "Thing-":
  uint8_t mac[WL_MAC_ADDR_LENGTH];
  WiFi.softAPmacAddress(mac);
  String macID = String(mac[WL_MAC_ADDR_LENGTH - 2], HEX) +
                 String(mac[WL_MAC_ADDR_LENGTH - 1], HEX);
  macID.toUpperCase();
  Serial.println (" ");
  String AP_NameString = ssid;
  AP_NameString += " " + macID;
  //  Serial.print ("AP Name (String): ");
  //  Serial.println (AP_NameString);
  //  Serial.print ("AP Name (length): ");
  //  Serial.println (AP_NameString.length());

  char AP_NameChar[AP_NameString.length() + 1];
  memset(AP_NameChar, AP_NameString.length() + 1, NULL);

  //  Serial.println ("AP Name (char by char): ");
  for (int i = 0; i < AP_NameString.length(); i++) {
    AP_NameChar[i] = AP_NameString.charAt(i);
    //    Serial.print ("  char(");
    //    Serial.print (i);
    //    Serial.print ("): ");
    //    Serial.println (AP_NameChar[i]);
  }
  AP_NameChar[AP_NameString.length()] = NULL;
  //  Serial.print ("  char(");
  //  Serial.print (AP_NameString.length());
  //  Serial.print ("): ");
  //  Serial.println (AP_NameChar[AP_NameString.length()]);
  //  Serial.print ("AP Name (char): ");
  //  Serial.println (AP_NameChar);

  //  WiFi.softAP(AP_NameChar, wifiPwd);
  WiFi.softAP(AP_NameChar);
  Serial.print(AP_NameChar);
  Serial.println(" started");

  return AP_NameString;
}

/********************************************************************
   name: AP_handleNotFound
   parameters: void
   returns: void
   description: function that manages a call to the "scan" page.
    it generates a web page that lists all the available WiFi
    networks. You can select the one you want to connect to and
    press a button to go to next step (password)
 ********************************************************************/
void AP_handleNotFound()
{
  //  digitalWrite(led, HIGH);
  String message = htmlHeader(0);
  message += "File Not Found\n\n";
  message += "<br>URI: ";
  message += webServer.uri();
  message += "\n<br>Method: ";
  message += (webServer.method() == HTTP_GET) ? "GET" : "POST";
  message += "\n<br>Arguments: ";
  message += webServer.args();
  for (uint8_t i = 0; i < webServer.args(); i++) {
    message += " " + webServer.argName(i) + ": " + webServer.arg(i) + "<br>\n";
  }
  message += "\n<p>Go <a href=\"/\">home</a></p></body></html>";
  webServer.send(404, "text/html", message);
  Serial.println("handle not found");
  Serial.print("URI: ");
  Serial.println(webServer.uri());
  Serial.print("Method: ");
  Serial.println((webServer.method() == HTTP_GET) ? "GET" : "POST");
  Serial.print("Arguments: ");
  Serial.println(webServer.args());
  for (uint8_t i = 0; i < webServer.args(); i++) {
    Serial.print(" ");
    Serial.print(webServer.argName(i));
    Serial.print(": ");
    Serial.println(webServer.arg(i));
  }
  //  digitalWrite(led, LOW);
}

/********************************************************************
   name: STA_handleNotFound
   parameters: void
   returns: void
   description: function that manages a call to the "scan" page.
    it generates a web page that lists all the available WiFi
    networks. You can select the one you want to connect to and
    press a button to go to next step (password)
 ********************************************************************/
void STA_handleNotFound()
{
  //  digitalWrite(led, HIGH);
  String message = htmlHeader(0);
  message += "File Not Found\n\n";
  message += "<br>URI: ";
  message += webServer.uri();
  message += "\n<br>Method: ";
  message += (webServer.method() == HTTP_GET) ? "GET" : "POST";
  message += "\n<br>Arguments: ";
  message += webServer.args();
  for (uint8_t i = 0; i < webServer.args(); i++) {
    message += " " + webServer.argName(i) + ": " + webServer.arg(i) + "<br>\n";
  }
  message += "\n<p>Go <a href=\"/\">home</a></p></body></html>";
  webServer.send(404, "text/html", message);
  Serial.println("handle not found");
  Serial.print("URI: ");
  Serial.println(webServer.uri());
  Serial.print("Method: ");
  Serial.println((webServer.method() == HTTP_GET) ? "GET" : "POST");
  Serial.print("Arguments: ");
  Serial.println(webServer.args());
  for (uint8_t i = 0; i < webServer.args(); i++) {
    Serial.print(" ");
    Serial.print(webServer.argName(i));
    Serial.print(": ");
    Serial.println(webServer.arg(i));
  }
  //  digitalWrite(led, LOW);
}

