AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
/********************************************************************
   name: STA_handleReset
   parameters: void
   returns: void
   description: function that manages a call to the "scan" page.
    it generates a web page that lists all the available WiFi
    networks. You can select the one you want to connect to and
    press a button to go to next step (password)
 ********************************************************************/
void STA_handleReset()
{
  //  digitalWrite(led, HIGH);
  clearEeprom ();
  String message = htmlHeader(0);
  if ((EEPROM.commit()) ? 1 : 0) {
    message += "EEPROM cleared";
  } else {
    message += "I could not clear the EEPROM";
  }
  message += "\n<p>Go <a href=\"/\">home</a></p></body></html>";
  webServer.send(200, "text/html", message);
  Serial.println("handle not found");
  Serial.print("URI: ");
  Serial.println(webServer.uri());
  Serial.print("Method: ");
  Serial.println((webServer.method() == HTTP_GET) ? "GET" : "POST");
  Serial.print("Arguments: ");
  Serial.println(webServer.args());
  for (uint8_t i = 0; i < webServer.args(); i++) {
    Serial.print(" ");
    Serial.print(webServer.argName(i));
    Serial.print(": ");
    Serial.println(webServer.arg(i));
  }
  //  digitalWrite(led, LOW);
}

/********************************************************************
   name: STA_handleRoot
   parameters: void
   returns: void
   description: ...
 ********************************************************************/
void STA_handleRoot()
{
  String ssid = "";
  int timeout = -1;

  //  digitalWrite(led, HIGH);
  String message = htmlHeader(0);
  message += "\n<h1>Hello from ESP8266</h1>";
  message += "\n<p>Connected to: ";
  message += WiFi.SSID();
  message += "</p>";
  message += "\n<p><a href=\"reset\">Reset Credentials</a></p>";
  message += "\n</body>";
  message += "\n</html>";
  webServer.send(200, "text/html", message);

  Serial.println("root handled");
  //  digitalWrite(led, LOW);
}

/********************************************************************
   name: AP_handleScanWiFi
   parameters: void
   returns: void
   description: function that manages a call to the "scan" page.
    it generates a web page that lists all the available WiFi
    networks. You can select the one you want to connect to and
    press a button to go to next step (password)
 ********************************************************************/
void AP_handleScanWiFi()
{
  //  digitalWrite(led, HIGH);

  int n = WiFi.scanNetworks();
  Serial.println("scan done");

  String message = htmlHeader(1);

  if (n == 0)
  {
    message += "<h1>no networks found</h1>";
    Serial.println(message);
  }
  else
  {
    message += "\n<form id=\"scanForm\" action=\"http://192.168.4.1/login\" enctype=\"text/plain\" method=\"POST\">";
    message += "\n<fieldset>";
    message += "\n<legend>";
    message += "I have found ";
    message += n;
    message += " networks.";
    message += "</legend>";
    for (int i = 0; i < n; ++i)
    {
      message += "\n";
      //      message += "\n<input name=\"auth\" type=\"hidden\" value=\"";
      //      message += (WiFi.encryptionType(i) == ENC_TYPE_NONE)?"0":"1";
      //      message += "\" />";
      message += "<input type=\"radio\" name=\"ssid\" ";
      message += (WiFi.encryptionType(i) == ENC_TYPE_NONE) ? "onclick=\"setPassVisibility('none');" : "onclick=\"setPassVisibility('inline');\" ";
      message += "value=\"";
      message += WiFi.SSID(i);
      message += "\"/>";
      message += WiFi.SSID(i);
      message += " (";
      message += WiFi.RSSI(i);
      message += " dBm)";
      message += (WiFi.encryptionType(i) == ENC_TYPE_NONE) ? " " : "* ";
      message += "<br />";
      delay(10);
    }
    message += "\n</fieldset>";
    message += "\n<div id=\"authDiv\">Auth: <input name=\"auth\" type=\"hidden\"/><br /></div>";
    message += "\n<div id=\"pass\">Password: <input name=\"pwd\" type=\"password\"/><br /></div>";
    message += "\n<input type=\"submit\"value=\"Connect to selected network\">";
    message += "\n<input type=\"reset\" value=\"Reset\">";
    message += "\n</form>";
    //    Serial.println(message);
  }
  message += "\n</body>";
  message += "\n</html>";
  webServer.send(200, "text/html", message);

  Serial.println("*** Scan page ***");
  //  digitalWrite(led, LOW);
}

/********************************************************************
   name:        htmlHeader
   returns:     [String]
   description:
 ********************************************************************/
String htmlHeader(int type) {
  String message;

  message = "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">";
  message += "\n<html>";
  message += "\n<head>";
  message += "\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\">";
  message += "\n<title>ESP8266 Sensor Setup</title>";
  if (type == 0) {
    message += "\n</head>";
    message += "\n<body>";
  } else if (type == 1) {
    message = "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">";
    message += "\n<html>";
    message += "\n<head>";
    message += "\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\">";
    message += "\n<title>ESP8266 Sensor Setup</title>";
    message += "\n<script>";
    message += "\nfunction init(){";
    message += "\nsetVisibility('pass', 'none');";
    message += "\n}";
    message += "\nfunction setVisibility(id, visibility) {";
    message += "\ndocument.getElementById(id).style.display = visibility;";
    message += "\n}";
    message += "\nfunction setPassVisibility(vis) {";
    message += "\nif ( vis == 'inline' ) {";
    message += "\ndocument.forms[\"scanForm\"][\"auth\"].value = \"1\";";
    message += "\n} else {";
    message += "\ndocument.forms[\"scanForm\"][\"auth\"].value = \"0\";";
    message += "\n}";
    message += "\ndocument.getElementById('pass').style.display = vis;";
    message += "\n}";
    message += "\nfunction myFunction(){";
    message += "\ndocument.getElementById(\"test\").innerHTML = \"new content\";";
    message += "\nsetVisibility('scanning', 'inline');";
    message += "\n}";
    message += "\n</script>";
    message += "\n</head>";
    message += "\n<body onload=\"init()\">";
  } else if (type == 2) {
    message = "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">";
    message += "\n<html>";
    message += "\n<head>";
    message += "\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=iso-8859-1\">";
    message += "\n<title>ESP8266 Sensor Setup</title>";
    message += "\n<script>";
  }

  return message;
}

