AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
/********************************************************************
   name: AP_handleLogin
   parameters: void
   returns: void
   description:
 ********************************************************************/

void AP_handleLogin()
{
  String ssid = "";
  String pwd = "";
  int auth = 0;

  //  digitalWrite(led, HIGH);
  Serial.println("*** Login page ***");
  if ( webServer.args() == 1 && find_text("\n", webServer.arg(0)) != -1 ) {
    //    Serial.println("* Reading arguments: strategy 1");
    char serverArgs[webServer.arg(0).length() + 1];
    memset(serverArgs, webServer.arg(0).length() + 1, NULL);
    for (int i = 0; i < webServer.arg(0).length(); ++i) {
      serverArgs[i] = webServer.arg(0).charAt(i);
      //      Serial.print(webServer.arg(0).charAt(i));
    }
    serverArgs[webServer.arg(0).length()] = NULL;
    Serial.println(" ");

    char * pch = strtok (serverArgs, "\n");
    int j = 0;
    while (pch != NULL)
    {
      char * p2ch = strpbrk(pch, "=");
      if (p2ch == NULL) {
        if (webServer.argName(0) == "ssid") {
          pch[strlen(pch) - 1] = NULL;
          ssid = pch;
        } else if (webServer.argName(0) == "pwd") {
          pch[strlen(pch) - 1] = NULL;
          pwd = pch;
        } else if (webServer.argName(0) == "auth") {
          pch[strlen(pch) - 1] = NULL;
          auth = atoi(pch);
        }
      } else {
        ++p2ch;
        if (strncmp (pch, "auth", 4) == 0) {
          auth = atoi(p2ch);
        } else if (strncmp (pch, "ssid", 4) == 0) {
          ssid = p2ch;
        } else if (strncmp (pch, "pwd", 3) == 0) {
          pwd = p2ch;
        }
      }
      pch = strtok (NULL, "\n");
      j++;

    }
  } else {
    //    Serial.println("* Reading arguments: strategy 2");
    for (uint8_t i = 0; i < webServer.args(); i++) {
      if (webServer.argName(i) == "ssid") {
        ssid = webServer.arg(i);
      } else if (webServer.argName(i) == "pwd") {
        pwd = webServer.arg(i);
      } else if (webServer.argName(i) == "auth") {
        (webServer.arg(i) == 0) ? auth = 0 : auth = 1;
      }
    }
  }
  Serial.print(ssid);
  Serial.print(" network has been selected. ");
  Serial.print( (( auth == 1 ) ? "Password: " : "Open network"));
  Serial.println( ( auth == 1 ) ? pwd : " ");

  // 3. confirm writing in webpage
  // 4a. if connection is successful, ask to restart
  // 4b. if connection dosn't work, go to scan page
  String message = htmlHeader(2);
  message += "\nfunction init(){";
  message += "\nvar nocache = '?nocache=' + Math.random() * 1000000;";
  message += "\nvar ssid = '&ssid=";
  message += ssid.c_str();
  message += "';";
  message += "\nvar auth = '&auth=";
  message += auth;
  message += "';";
  message += "\nvar pwd = '&pwd=";
  message += pwd.c_str();
  message += "';";
  message += "\nvar params = nocache + ssid + auth + pwd;";
  message += "\nvar request = new XMLHttpRequest();";
  message += "\nrequest.onreadystatechange = function() {";
  message += "\nvar statusStr = 'onreadystatechange: ' + this.readyState; ";
  message += "\ndocument.getElementById('http').innerHTML = statusStr;";
  message += "\nif (this.readyState == 4) {";
  message += "\nstatusStr = statusStr + ' - readyState: ' + this.status; ";
  message += "\ndocument.getElementById('http').innerHTML = statusStr; ";
  message += "\nif (this.status == 200) {";
  message += "\nstatusStr = statusStr + ' - status: ' + this.status;";
  message += "\ndocument.getElementById('http').innerHTML = statusStr;";
  message += "\nif (this.responseText != null) {";
  message += "\ndocument.getElementById('http').innerHTML = statusStr + ' - no status responsetext';";
  message += "\n}}}}";
  message += "\nrequest.open('POST', 'connect', true);";
  message += "\nrequest.setRequestHeader('Content-type', 'application/x-www-form-urlencoded');";
  message += "\nrequest.send(params);";
  message += "\ndocument.getElementById('request').innerHTML = 'request sent to connect. params: ' + params;";
  message += "\n}";
  message += "\n</script>";
  message += "\n</head>";
  message += "\n<body onload=\"init()\">";
  message += "\n<h1>*** Login page ***</h1><br>\n";
  message += ssid;
  message += " network has been selected. <br>\n";
  message += ( auth == 1 ) ? "Password sent<br>" : "Open network<btr>";
  //  message += ( auth==1 )? pwd:" ";
  message += "\n<div id=\"status\">Connecting to ";
  message += ssid;
  message += "</div><br>";
  message += "\nSending request <br>";
  message += "\n<div id=\"request\">test</div><br>";
  message += "\nhttp request <br>";
  message += "\n<div id=\"http\">test</div><br>";
  message += "\n</body>";
  message += "\n</html>";
  webServer.send(200, "text/html", message);

  Serial.println (" ");
  //  Serial.println(message);

  //  digitalWrite(led, LOW);
}

/********************************************************************
   name: AP_handleConnect
   parameters: void
   returns: void
   description:
 ********************************************************************/

void AP_handleConnect()
{
  String qssid;
  String qpwd;
  int qauth;
  String message = "";

  Serial.println("*** Connection Page ***");

  // Reading arguments
  Serial.println(" Reading Arguments");
  if ( webServer.args() == 1 && find_text("\n", webServer.arg(0)) != -1 ) {
    char serverArgs[webServer.arg(0).length() + 1];
    memset(serverArgs, webServer.arg(0).length() + 1, NULL);
    for (int i = 0; i < webServer.arg(0).length(); ++i) {
      serverArgs[i] = webServer.arg(0).charAt(i);
    }
    serverArgs[webServer.arg(0).length()] = NULL;

    char * pch = strtok (serverArgs, "\n");
    int j = 0;
    while (pch != NULL)
    {
      char * p2ch = strpbrk(pch, "=");
      if (p2ch == NULL) {
        if (webServer.argName(0) == "ssid") {
          qssid = pch;
        } else if (webServer.argName(0) == "pwd") {
          qpwd = pch;
        } else if (webServer.argName(0) == "auth") {
          (pch == 0) ? qauth = 0 : qauth = 1;
        }
      } else {
        ++p2ch;
        if (strncmp (pch, "auth", 4) == 0) {
          qauth = atoi(p2ch);
        } else if (strncmp (pch, "ssid", 4) == 0) {
          qssid = p2ch;
        } else if (strncmp (pch, "pwd", 3) == 0) {
          qpwd = p2ch;
        }
      }
      pch = strtok (NULL, "\n");
      j++;
    }
  } else {
    for (uint8_t i = 0; i < webServer.args(); i++) {
      if (webServer.argName(i) == "ssid") {
        qssid = webServer.arg(i);
      } else if (webServer.argName(i) == "pwd") {
        qpwd = webServer.arg(i);
      } else if (webServer.argName(i) == "auth") {
        (webServer.arg(i) == 0) ? qauth = 0 : qauth = 1;
      }
    }
  }
  message += "\n SSID: ";
  message += qssid;
  message += "\n pwd: ";
  message += qpwd;
  message += "\n auth: ";
  message += qauth;
  Serial.println(message);

