AugMantua/ScienceGround2021/src/mcu/ESP8266_CCS811_HDC1080_BMP280_OLED_Thingspeak_GP2Y10_Config.ino.cpp
  // Try to connect

  // Save data to EEPROM
  if (qssid.length() > 0 && qpwd.length() > 0 && qauth == 1 ) {
    message += "SSID and password received";
    clearEeprom();
    save2Eeprom (qssid, 0);
    save2Eeprom (qpwd, 32);
    EEPROM.commit();
    credentials = true;
  } else if (qssid.length() > 0 && qauth == 0 ) {
    message += "SSID received";
    clearEeprom();
    save2Eeprom (qssid, 0);
    EEPROM.commit();
    credentials = true;
  }

  webServer.send(200, "application/json", message);
}

/*
   http://playground.arduino.cc/Main/FindText
*/
int find_text(String needle, String haystack) {
  int foundpos = -1;
  for (int i = 0; (i < haystack.length() - needle.length()); i++) {
    if (haystack.substring(i, needle.length() + i) == needle) {
      foundpos = i;
    }
  }
  return foundpos;
}

/*

*/
void clearEeprom () {
  Serial.println("clearing EEPROM");
  for (int i = 0; i < 96; ++i) {
    EEPROM.write(i, NULL);
  }
}

/*
   returns number of characters written
*/
int save2Eeprom (String str, int first) {
  Serial.println("writing EEPROM");

  // verify that length is less than space
  int last = first + str.length();
  int i;
  for (i = 0; i < str.length(); ++i) {
    EEPROM.write(first + i, str[i]);
  }
  return i;
}

/*

*/
int tryConnecting(String ssid, String pass, int auth) {
  int len = 0;
  int completed = 0;
  while (completed == 0) {
    if (ssid.c_str()[len++] == NULL) {
      completed = 1;
    }
  }

  if ( len > 1 ) {
    Serial.println("SSID contains ");
    Serial.println(len - 1);
    Serial.println(" characters");
    // test essid
    // try to start wifi connection with just read SSID and password
    WiFi.begin(ssid.c_str(), pass.c_str());
    // test wifi connection with just read SSID and password
    if ( testWifi() == 20 ) {
      Serial.println("");
      Serial.println("WiFi connected");
      return 20;
    } else {
      Serial.println("");
      Serial.println("Could not connect to WiFi");
    }
  } else {
    return 0;
  }
}

